app/controllers/authorize_controller.rb

SELECT id,title,description FROM `roles` WHERE (record_sts='ACTV')
---
  def roles
    @roles ||= Role.find( :all,
                         :select=>"id,title,description",
    :conditions=>"record_sts='ACTV'")

SELECT * FROM `users` WHERE (`users`.`domain` = 'test')
SELECT * FROM `users`
---
  def user_list

    users ||= User.find(:all, :conditions=>{:domain=>params[:domain]}) unless params[:domain].nil?
    users ||= User.find(:all) if params[:domain].nil?

    users_list = users.map {|user| {

SELECT * FROM `roles` WHERE (title = 'guest') LIMIT 1
SELECT `users`.id FROM `users` WHERE (LOWER(`users`.`login`) = BINARY 'tester') LIMIT 1
INSERT INTO `users` (`last_login_at`, `domain_description`, `last_request_at`, `updated_at`, `style_id`, `crypted_password`, `single_access_token`, `perishable_token`, `current_login_ip`, `role_id`, `domain`, `password_salt`, `current_login_at`, `record_sts`, `failed_login_count`, `persistence_token`, `login_count`, `login`, `email`, `last_login_ip`, `created_at`) VALUES(NULL, NULL, '2009-10-13 08:42:45', '2009-10-13 08:42:45', NULL, '638626ebda4d36f4afc3f38de5481c27aed95839', 'BeLZu6oB5azYTX6g_MXN', 'VRWVN6B5KSgDoexOs1G0', '127.0.0.1', NULL, 'tester', 'd974f3eea50424c88329860358532e8d673338de', '2009-10-13 08:42:45', 'ACTV', 0, 'b7b467adc74899d37b568e05e670fab64da1e8df66ed8482157e4628b73bd9e2e515101adc569448a6f297d8f7b8011c63063cd0ff1b99f9f8a0218f2216ea49', 1, 'tester', 'tester@tester.tes', NULL, '2009-10-13 08:42:45')
UPDATE `users` SET `perishable_token` = 'cIGKlYyzK9PZ7QEMW3y_', `updated_at` = '2009-10-13 09:40:33', `last_request_at` = '2009-10-13 09:40:33' WHERE `id` = 1
---
  def signup
    return unless request.post?
    @user = User.new( :login=>params[:login],
                     :email=>params[:email],
                     :password=>params[:password],
                     :password_confirmation=>params[:password_confirmation],
                     :domain=>(params[:domain].nil? ? params[:login] : params[:domain]) )

    @user.role = Role.find(:first, :conditions=>"title = 'guest'")
    @user.style = Style.find(:first)

    if(@user.save)

SELECT * FROM `users` WHERE (`users`.`id` = 4)
UPDATE `users` SET `perishable_token` = 'nHR8GtMWKuudhT3bPju-', `role_id` = 3, `updated_at` = '2009-10-13 14:31:04' WHERE `id` = 2
---
  def update

    @reply_remote = Hash.new()

    unless params[:user].nil?
      user = ActiveSupport::JSON.decode(params[:user]).rehash
      @user = User.find(user["id"])

      user[:role_id]= user["role"]
      user.delete("role")
      user.delete("active")
      @user.update_attributes(user)

SELECT * FROM `users` WHERE (`users`.`id` = 4)
UPDATE `users` SET `perishable_token` = '42cDCIxegxk6C3AhvIt4', `updated_at` = '2009-10-13 21:17:42' WHERE `id` = 3
---
  def remove
    user = ActiveSupport::JSON.decode(params[:user]).rehash
    @user = User.find(user["id"])

    @reply_remote = Hash.new()

    unless @user.nil?

      if user["active"].eql? "Active"
        @user[:activated_at]= ''
      else
        @user[:activated_at]= Time.now.strftime("%Y-%m-%d %H:%M:%S")
      end


      @user.save

SELECT * FROM `users` WHERE (`users`.`email` = 'tester@tester.tes') LIMIT 1
UPDATE `users` SET `perishable_token` = 'cmQgEeBMWC3QlMMb26Mi', `updated_at` = '2009-10-13 20:08:31' WHERE `id` = 1
---
  def forgot_password
    return unless request.post?
    if @user = User.find_by_email(params[:email])
      @user.forgot_password
      @user.save

SELECT * FROM `users` WHERE (perishable_token = 'Iae3u_Wh2QtWjoV6qJUh' and updated_at > '2009-10-13 20:15:17') LIMIT 1
UPDATE `users` SET `login_count` = 3, `persistence_token` = '3b2b4e1f460009e24149e0c5f9049332dae78d7b250499fbe8e1d4ad1d6f366dc99346e1951f45b0d419ff380c1c9b5d4731c2f0cc7876396d5fd191af7a7d53', `perishable_token` = 'x08YniVHL77ySVEzlW1M', `crypted_password` = 'd46836b0ad6791e13fbb95ef679ba1e3277691339db2e74bab985501c344420487728df4e4e611e6c38257dd76688dcea66a776fc7f7e36aae27b76e1f07f8a8', `last_login_at` = '2009-10-13 20:43:49', `updated_at` = '2009-10-13 20:58:55', `last_request_at` = '2009-10-13 20:58:55', `current_login_at` = '2009-10-13 20:58:55', `password_salt` = 'AgvrLbkWU0kceIxF5NFX' WHERE `id` = 3
---
  def reset_password
    return if params[:id].nil?
    @user = User.find_using_perishable_token(params[:id])
    raise if @user.nil?
    return if @user unless params[:password]
    if (params[:password] == params[:password_confirmation])
      @user.password_confirmation = params[:password_confirmation]
      @user.password = params[:password]
      @user.reset_password
      #@user.login = params[:login] unless params[:login].nil?
      #@user.email = params[:email] unless params[:email].nil?

      if(@user.save)