app/controllers/desktop_controller.rb

SELECT * FROM `appmodules` INNER JOIN `appmodules_launchers` ON `appmodules`.id = `appmodules_launchers`.appmodule_id WHERE (`appmodules_launchers`.launcher_id = 1 )
SELECT * FROM `roles` WHERE (`roles`.`id` = 1)
SELECT * FROM `appfiles` INNER JOIN `appfiles_appmodules` ON `appfiles`.id = `appfiles_appmodules`.appfile_id WHERE (`appfiles_appmodules`.appmodule_id = 15 ) ORDER BY id DESC
---
    #  modules (list of modules) = 1,2,3 and platform and etc.
    # end

    current_user.role.appmodules.each{|item|
                  modules<<item.moduleName if item.record_sts == 'ACTV'
                  @loaded_js[:app] << item if (item.moduleType == 'app' && item.record_sts == 'ACTV')
                  item.appfiles.each{|itm|

SELECT * FROM `launchers`
---
    logger.warn "Loaded javascripts : #{modules.to_yaml}"
    launchers = Hash.new
    launchers_db = Launcher.find(:all)
    launchers_db.each{|item|

SELECT * FROM `appmodules` WHERE (`appmodules`.`moduleId` = 'bookmarks') ORDER BY id DESC LIMIT 1
SELECT * FROM `appfiles` INNER JOIN `appfiles_appmodules` ON `appfiles`.id = `appfiles_appmodules`.appfile_id WHERE (`appfiles_appmodules`.appmodule_id = 10 ) ORDER BY id DESC
---
  def on_demand ()
    appmodule = Appmodule.find(:first, :conditions=>{:moduleId => params[:moduleId]}, :order=>"id DESC")
    file_src = ""
    appmodule.appfiles.sort{|x,y| y.id<=>x.id}.each{|appfile|